app/controllers/projects_controller.rb

	def update
		@project = Project.find(params[:id])
		if @project.update(project_params)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "projects"."id" = 1  [["name", "TextMate 2 beta"], ["description", ""], ["updated_at", Wed, 12 Feb 2014 16:29:39 UTC +00:00]]

	def create
		@project = Project.new(project_params)
		if @project.save
---
INSERT INTO "projects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 07 Feb 2014 11:56:18 UTC +00:00], ["description", "A text-editor for OS X"], ["name", "TextMate 2"], ["updated_at", Fri, 07 Feb 2014 11:56:18 UTC +00:00]]

	def destroy
		@project = Project.find(params[:id])
		@project.destroy
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 1]]